In [5]:
# Importing
import pandas as pd
import altair as alt
import numpy as np

from IPython.display import Markdown
from IPython.display import display
from tabulate import tabulate
import sqlite3

In [6]:
# Load Dataset
con = sqlite3.connect("lahmansbaseballdb.sqlite")

,ID,playerID,yearID,stint,teamID,team_ID,lgID,POS,G,GS,InnOuts,PO,A,E,DP,PB,WP,SB,CS,ZR
0,1,abercda01,1871,1,TRO,8,NA,SS,1,1,24,1,3,2,0,None,None,None,None,None
1,2,addybo01,1871,1,RC1,7,NA,2B,22,22,606,67,72,42,5,None,None,None,None,None
2,3,addybo01,1871,1,RC1,7,NA,SS,3,3,96,8,14,7,0,None,None,None,None,None
3,4,allisar01,1871,1,CL1,3,NA,2B,2,0,18,1,4,0,0,None,None,None,None,None
4,5,allisar01,1871,1,CL1,3,NA,OF,29,29,729,51,3,7,1,None,None,None,None,None

In [70]:
# SQL Query
sql = """
SELECT DISTINCT
    p.playerid, c.schoolid, s.salary, s.yearid, s.teamid
FROM
    people AS p
JOIN CollegePlaying as c ON p.playerid = c.playerid
JOIN Salaries as s ON c.playerid = s.playerid
WHERE c.schoolid = 'idbyuid'
ORDER BY s.salary DESC
"""

df = pd.read_sql_query(sql, con)
print(df.shape)
df

(15, 5)

     playerID schoolID     salary  yearID teamID
0   lindsma01  idbyuid  4000000.0    2014    CHA
1   lindsma01  idbyuid  3600000.0    2012    BAL
2   lindsma01  idbyuid  2800000.0    2011    COL
3   lindsma01  idbyuid  2300000.0    2013    CHA
4   lindsma01  idbyuid  1625000.0    2010    HOU
5   stephga01  idbyuid  1025000.0    2001    SLN
6   stephga01  idbyuid   900000.0    2002    SLN
7   stephga01  idbyuid   800000.0    2003    SLN
8   stephga01  idbyuid   550000.0    2000    SLN
9   lindsma01  idbyuid   410000.0    2009    FLO
10  lindsma01  idbyuid   395000.0    2008    FLO
11  lindsma01  idbyuid   380000.0    2007    FLO
12  stephga01  idbyuid   215000.0    1999    SLN
13  stephga01  idbyuid   185000.0    1998    PHI
14  stephga01  idbyuid   150000.0    1997    PHI

In [45]:
# Results

Empty DataFrame
Columns: [playerID, schoolID, salary, yearID, teamID]
Index: []